Requests_control/src/Catalogs/Нумераторы/Нумераторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Нумераторы</name>
  <attributes>
    <name>ФорматНомера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пример</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Requests_control/src/InformationRegisters/Нумерация/Нумерация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Нумерация</name>
  <resources>
    <name>ТекущийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СвязанныйДокумент</name>
    <type>
      <types>CatalogRef.Обращения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодНумерации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Requests_control/src/Catalogs/Обращения/Обращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Обращения</name>
  <attributes>
    <name>ВидОбращения</name>
    <type>
      <types>CatalogRef.ВидыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВсеВопросыНаРассмотрении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоОбращению</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Заявители</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ОрганыИУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбратившихся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерИДатаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособНумерации</name>
    <type>
      <types>EnumRef.СпособыНумерации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотрения</name>
    <comment>Плановый срок рассмотрения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокРассмотренияПервоначальный</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>EnumRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.Вопросы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтвета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящаяДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийНомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОМерах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МнениеАвтораОРезультатах</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОрганДляПередачи</name>
      <type>
        <types>CatalogRef.ОрганыИУчреждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.Разделы</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатРассмотрения</name>
      <type>
        <types>EnumRef.РезультатыРассмотрения</types>
      </type>
    </attributes>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.Темы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тематика</name>
      <type>
        <types>CatalogRef.Тематики</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Requests_control/src/Catalogs/Нумераторы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ФорматНомера) Тогда 
		Объект.ФорматНомера = НСтр("ru = '[Номер]'");
	КонецЕсли;
	
	Элементы.СледующийНомер.Видимость = Истина;
	Если СледующийНомер > 1 Тогда 
		Элементы.СледующийНомер.Заголовок = НСтр("ru = 'Следующий'");
		Элементы.СледующийНомер.Подсказка = НСтр("ru = 'Следующий номер'");
	КонецЕсли;
	
	Если Параметры.Свойство("ВидОбращения") И ЗначениеЗаполнено(Параметры.ВидОбращения) Тогда 
		ВидОбращения = Параметры.ВидОбращения;
	КонецЕсли;
	
	Элементы.ИндексВидаОбращения.Видимость = ПолучитьФункциональнуюОпцию("УчитыватьВидыОбращений");
	
	СледующийНомер = ОпределитьТекущийНомер();
	СледующийНомерПриОткрытии = СледующийНомер;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если СледующийНомерПриОткрытии <> СледующийНомер Тогда 
		МенеджерЗаписи = РегистрыСведений.Нумерация.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидОбращения = ВидОбращения;
		МенеджерЗаписи.ПериодНумерации = НачалоГода(ТекущаяДата());
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.ТекущийНомер <> СледующийНомер-1 Тогда 
			МенеджерЗаписи.ВидОбращения = ВидОбращения;
			МенеджерЗаписи.ПериодНумерации = НачалоГода(ТекущаяДата());
			МенеджерЗаписи.ТекущийНомер = СледующийНомер-1;
			МенеджерЗаписи.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СледующийНомерПриОткрытии = СледующийНомер;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФорматНомераПриИзменении(Элемент)
	
	СформироватьПримерНомера();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДеньМесяца(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[День]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерМесяца(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[Месяц]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКвартала(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[Квартал]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Год2(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[Год2]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Год4(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[Год4]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексОтветственного(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[ИндексОтв]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура ИндексВидаОбращения(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[ИндексВида]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДокументаОснования(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[НомерДокОсн]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Номер(Команда)
	
	Объект.ФорматНомера = Объект.ФорматНомера + "[Номер]";
	СформироватьПримерНомера();
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ФорматНомера", СокрЛП(Объект.ФорматНомера));
	ПараметрыЗакрытия.Вставить("ПримерНомера", СокрЛП(Объект.Пример));
	ПараметрыЗакрытия.Вставить("СледующийНомер", СледующийНомер);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьПримерНомера()
	
	ОписаниеОшибки = "";
	Если Не Нумерация.СформироватьПримерНомера(Объект.ФорматНомера, Объект.Пример, ОписаниеОшибки) Тогда 
		Объект.Пример = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка в формате номера: %1'"), ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьТекущийНомер()
	
	СтруктураИзмерений = Новый Структура;
	СтруктураИзмерений.Вставить("ПериодНумерации", 	  Нумерация.НачалоПериодаНумерации(ТекущаяДатаСеанса()));
	СтруктураИзмерений.Вставить("СвязанныйДокумент", Справочники.Обращения.ПустаяСсылка());
	СтруктураИзмерений.Вставить("ВидОбращения", 	  ВидОбращения);
	
	ТекущийНомер = РегистрыСведений.Нумерация.Получить(СтруктураИзмерений).ТекущийНомер + 1; 
	
	Возврат ТекущийНомер;
	
КонецФункции

#КонецОбласти
